Tests/sysbench_results_c8g.2xlarge_20250605_134559.txt
=====================================================================
SYSBENCH COMPREHENSIVE BENCHMARK RESULTS
=====================================================================
Start Time: Thu Jun  5 13:45:59 UTC 2025
Hostname: ip-172-28-34-204.8067.aws-int.thomsonreuters.com
Instance Type: c8g.2xlarge
Operating System: Linux ip-172-28-34-204.8067.aws-int.thomsonreuters.com 6.1.131-143.221.amzn2023.aarch64 #1 SMP Mon Mar 24 15:34:49 UTC 2025 aarch64 aarch64 aarch64 GNU/Linux
CPU Info: AWS Graviton4
CPU Cores: 8
Memory: 15Gi
=====================================================================

[2025-06-05 13:45:59] Starting Sysbench Comprehensive Benchmark Suite
[2025-06-05 13:45:59] Results will be saved to: sysbench_results_c8g.2xlarge_20250605_134559.txt
[2025-06-05 13:45:59] ================================================
[2025-06-05 13:45:59] Checking prerequisites...
[2025-06-05 13:45:59] k6 found - K6 tests will be included
[SUCCESS] Prerequisites check passed
[2025-06-05 13:45:59] Setting up PostgreSQL database and user...
[SUCCESS] PostgreSQL setup completed
[2025-06-05 13:45:59] Starting CPU benchmarks...
[2025-06-05 13:45:59] Detected 8 CPU cores

=====================================================================
SINGLE-CORE CPU BENCHMARK (10 minutes)
=====================================================================

[2025-06-05 13:45:59] Running single-core CPU benchmark (10 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Prime numbers limit: 2000

Initializing worker threads...

Threads started!

[ 10s ] thds: 1 eps: 34238.70 lat (ms,95%): 0.03
[ 20s ] thds: 1 eps: 34322.15 lat (ms,95%): 0.03
[ 30s ] thds: 1 eps: 34361.56 lat (ms,95%): 0.03
[ 40s ] thds: 1 eps: 34373.92 lat (ms,95%): 0.03
[ 50s ] thds: 1 eps: 34378.49 lat (ms,95%): 0.03
[ 60s ] thds: 1 eps: 34378.30 lat (ms,95%): 0.03
[ 70s ] thds: 1 eps: 34405.05 lat (ms,95%): 0.03
[ 80s ] thds: 1 eps: 34403.10 lat (ms,95%): 0.03
[ 90s ] thds: 1 eps: 34421.87 lat (ms,95%): 0.03
[ 100s ] thds: 1 eps: 34435.82 lat (ms,95%): 0.03
[ 110s ] thds: 1 eps: 34433.03 lat (ms,95%): 0.03
CPU speed:
    events per second: 34382.43

Throughput:
    events/s (eps):                      34382.4318
    time elapsed:                        120.0004s
    total number of events:              4125907

Latency (ms):
         min:                                    0.03
         avg:                                    0.03
         max:                                    0.13
         95th percentile:                        0.03
         sum:                               119553.20

Threads fairness:
    events (avg/stddev):           4125907.0000/0.00
    execution time (avg/stddev):   119.5532/0.00

[SUCCESS] Single-core CPU benchmark completed

=====================================================================
MULTI-CORE CPU BENCHMARK (10 minutes)
=====================================================================

[2025-06-05 13:47:59] Running multi-core CPU benchmark (10 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Prime numbers limit: 2000

Initializing worker threads...

Threads started!

[ 10s ] thds: 8 eps: 274977.95 lat (ms,95%): 0.03
[ 20s ] thds: 8 eps: 276956.25 lat (ms,95%): 0.03
[ 30s ] thds: 8 eps: 276113.74 lat (ms,95%): 0.03
[ 40s ] thds: 8 eps: 276551.64 lat (ms,95%): 0.03
[ 50s ] thds: 8 eps: 276362.29 lat (ms,95%): 0.03
[ 60s ] thds: 8 eps: 276451.65 lat (ms,95%): 0.03
[ 70s ] thds: 8 eps: 275774.60 lat (ms,95%): 0.03
[ 80s ] thds: 8 eps: 276475.34 lat (ms,95%): 0.03
[ 90s ] thds: 8 eps: 276689.65 lat (ms,95%): 0.03
[ 100s ] thds: 8 eps: 276731.39 lat (ms,95%): 0.03
[ 110s ] thds: 8 eps: 276139.04 lat (ms,95%): 0.03
CPU speed:
    events per second: 276326.48

Throughput:
    events/s (eps):                      276326.4805
    time elapsed:                        120.0002s
    total number of events:              33159233

Latency (ms):
         min:                                    0.03
         avg:                                    0.03
         max:                                   25.15
         95th percentile:                        0.03
         sum:                               956384.58

Threads fairness:
    events (avg/stddev):           4144904.1250/44611.00
    execution time (avg/stddev):   119.5481/0.00

[SUCCESS] Multi-core CPU benchmark completed
[2025-06-05 13:49:59] Cleaning up PostgreSQL test data...

=====================================================================
POSTGRESQL CLEANUP
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
[SUCCESS] PostgreSQL cleanup completed
[2025-06-05 13:49:59] Preparing PostgreSQL test data...

=====================================================================
POSTGRESQL DATA PREPARATION
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Creating table 'sbtest1'...
Inserting 1000000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 1000000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 1000000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 1000000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest5'...
Inserting 1000000 records into 'sbtest5'
Creating a secondary index on 'sbtest5'...
Creating table 'sbtest6'...
Inserting 1000000 records into 'sbtest6'
Creating a secondary index on 'sbtest6'...
Creating table 'sbtest7'...
Inserting 1000000 records into 'sbtest7'
Creating a secondary index on 'sbtest7'...
Creating table 'sbtest8'...
Inserting 1000000 records into 'sbtest8'
Creating a secondary index on 'sbtest8'...
Creating table 'sbtest9'...
Inserting 1000000 records into 'sbtest9'
Creating a secondary index on 'sbtest9'...
Creating table 'sbtest10'...
Inserting 1000000 records into 'sbtest10'
Creating a secondary index on 'sbtest10'...
[SUCCESS] PostgreSQL test data preparation completed
[2025-06-05 13:51:33] Starting PostgreSQL benchmarks...

=====================================================================
READ-ONLY BENCHMARK (2 minutes)
=====================================================================

[2025-06-05 13:51:33] Running Read-Only benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 9283.29 qps: 148540.09 (r/w/o: 129972.82/0.00/18567.27) lat (ms,95%): 1.03 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 9464.01 qps: 151425.27 (r/w/o: 132497.15/0.00/18928.12) lat (ms,95%): 0.95 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 9627.71 qps: 154040.93 (r/w/o: 134785.50/0.00/19255.43) lat (ms,95%): 0.90 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 9234.20 qps: 147749.27 (r/w/o: 129280.87/0.00/18468.40) lat (ms,95%): 1.16 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 9272.50 qps: 148360.28 (r/w/o: 129815.27/0.00/18545.01) lat (ms,95%): 1.14 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 9666.08 qps: 154656.21 (r/w/o: 135324.16/0.00/19332.05) lat (ms,95%): 0.89 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 9702.62 qps: 155245.24 (r/w/o: 135839.89/0.00/19405.34) lat (ms,95%): 0.89 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 9706.90 qps: 155305.26 (r/w/o: 135891.45/0.00/19413.81) lat (ms,95%): 0.89 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 9707.08 qps: 155316.16 (r/w/o: 135902.00/0.00/19414.16) lat (ms,95%): 0.89 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 9710.81 qps: 155371.57 (r/w/o: 135949.95/0.00/19421.62) lat (ms,95%): 0.89 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 9690.41 qps: 155047.92 (r/w/o: 135667.20/0.00/19380.71) lat (ms,95%): 0.89 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 9666.45 qps: 154663.21 (r/w/o: 135330.31/0.00/19332.90) lat (ms,95%): 0.89 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            16062802
        write:                           0
        other:                           2294686
        total:                           18357488
    transactions:                        1147343 (9560.99 per sec.)
    queries:                             18357488 (152975.85 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      9560.9907
    time elapsed:                        120.0025s
    total number of events:              1147343

Latency (ms):
         min:                                    0.56
         avg:                                    0.84
         max:                                   24.44
         95th percentile:                        0.90
         sum:                               958985.82

Threads fairness:
    events (avg/stddev):           143417.8750/2100.93
    execution time (avg/stddev):   119.8732/0.00

[SUCCESS] Read-Only benchmark completed

=====================================================================
WRITE-ONLY BENCHMARK (2 minutes)
=====================================================================

[2025-06-05 13:53:33] Running Write-Only benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 1063.04 qps: 6382.23 (r/w/o: 0.00/4255.35/2126.88) lat (ms,95%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 1139.79 qps: 6838.71 (r/w/o: 0.00/4559.14/2279.57) lat (ms,95%): 25.28 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 265.80 qps: 1594.82 (r/w/o: 0.00/1063.21/531.61) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 1152.79 qps: 6916.75 (r/w/o: 0.00/4611.17/2305.58) lat (ms,95%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 279.50 qps: 1676.99 (r/w/o: 0.00/1117.99/559.00) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 1142.91 qps: 6857.43 (r/w/o: 0.00/4571.62/2285.81) lat (ms,95%): 27.17 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 397.58 qps: 2385.47 (r/w/o: 0.00/1590.32/795.16) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 1036.06 qps: 6216.33 (r/w/o: 0.00/4144.22/2072.11) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 533.12 qps: 3198.70 (r/w/o: 0.00/2132.47/1066.23) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 918.87 qps: 5511.22 (r/w/o: 0.00/3673.48/1837.74) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 660.32 qps: 3963.92 (r/w/o: 0.00/2643.28/1320.64) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 797.28 qps: 4783.66 (r/w/o: 0.00/3189.11/1594.55) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           375520
        other:                           187760
        total:                           563280
    transactions:                        93880  (782.22 per sec.)
    queries:                             563280 (4693.31 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      782.2180
    time elapsed:                        120.0177s
    total number of events:              93880

Latency (ms):
         min:                                    1.50
         avg:                                   10.23
         max:                                  187.88
         95th percentile:                       38.25
         sum:                               959966.88

Threads fairness:
    events (avg/stddev):           11735.0000/0.50
    execution time (avg/stddev):   119.9959/0.01

[SUCCESS] Write-Only benchmark completed

=====================================================================
READ-WRITE BENCHMARK (2 minutes)
=====================================================================

[2025-06-05 13:55:33] Running Read-Write benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 402.06 qps: 8056.48 (r/w/o: 5640.09/1611.46/804.93) lat (ms,95%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 277.30 qps: 5546.02 (r/w/o: 3882.22/1109.20/554.60) lat (ms,95%): 130.13 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 354.80 qps: 7095.99 (r/w/o: 4967.19/1419.20/709.60) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 519.60 qps: 10392.00 (r/w/o: 7274.40/2078.40/1039.20) lat (ms,95%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 256.80 qps: 5136.01 (r/w/o: 3595.21/1027.20/513.60) lat (ms,95%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 740.90 qps: 14818.01 (r/w/o: 10372.61/2963.60/1481.80) lat (ms,95%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 316.40 qps: 6328.00 (r/w/o: 4429.60/1265.60/632.80) lat (ms,95%): 41.85 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 586.20 qps: 11724.01 (r/w/o: 8206.80/2344.80/1172.40) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 595.10 qps: 11901.99 (r/w/o: 8331.39/2380.40/1190.20) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 277.30 qps: 5544.00 (r/w/o: 3881.80/1107.60/554.60) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 930.10 qps: 18604.01 (r/w/o: 13021.81/3722.00/1860.20) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 262.30 qps: 5246.00 (r/w/o: 3672.20/1049.20/524.60) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            772758
        write:                           220788
        other:                           110394
        total:                           1103940
    transactions:                        55197  (459.90 per sec.)
    queries:                             1103940 (9197.91 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      459.8954
    time elapsed:                        120.0208s
    total number of events:              55197

Latency (ms):
         min:                                    1.60
         avg:                                   17.39
         max:                                  344.12
         95th percentile:                       38.94
         sum:                               960025.54

Threads fairness:
    events (avg/stddev):           6899.6250/17.00
    execution time (avg/stddev):   120.0032/0.00

[SUCCESS] Read-Write benchmark completed

=====================================================================
OLTP POINT SELECT BENCHMARK
=====================================================================

[2025-06-05 13:57:33] Running OLTP Point Select benchmark...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            1467268
        write:                           0
        other:                           0
        total:                           1467268
    transactions:                        1467268 (146714.47 per sec.)
    queries:                             1467268 (146714.47 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      146714.4665
    time elapsed:                        10.0008s
    total number of events:              1467268

Latency (ms):
         min:                                    0.02
         avg:                                    0.05
         max:                                  425.85
         95th percentile:                        0.09
         sum:                                79757.61

Threads fairness:
    events (avg/stddev):           183408.5000/2880.54
    execution time (avg/stddev):   9.9697/0.00

[SUCCESS] OLTP Point Select benchmark completed

=====================================================================
OLTP UPDATE INDEX BENCHMARK
=====================================================================

[2025-06-05 13:57:43] Running OLTP Update Index benchmark...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           23425
        other:                           0
        total:                           23425
    transactions:                        23425  (2336.25 per sec.)
    queries:                             23425  (2336.25 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      2336.2477
    time elapsed:                        10.0268s
    total number of events:              23425

Latency (ms):
         min:                                    1.11
         avg:                                    3.42
         max:                                  143.08
         95th percentile:                        3.68
         sum:                                80148.23

Threads fairness:
    events (avg/stddev):           2928.1250/0.33
    execution time (avg/stddev):   10.0185/0.01

[SUCCESS] OLTP Update Index benchmark completed
[2025-06-05 13:57:53] Starting K6 benchmarks...
[2025-06-05 13:57:53] Truncating cache table...
TRUNCATE TABLE
[SUCCESS] Cache table truncated

=====================================================================
K6 AOT INSERT TEST
=====================================================================

[2025-06-05 13:57:54] Running K6 AOT Insert test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/aot/insert-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 80/80 VUs, 15002 complete and 0 interrupted iterations
default   [  15% ] 80 VUs  00m01.0s/10m0s  015004/100000 shared iters

running (00m02.0s), 80/80 VUs, 36440 complete and 0 interrupted iterations
default   [  36% ] 80 VUs  00m02.0s/10m0s  036441/100000 shared iters

running (00m03.0s), 80/80 VUs, 57912 complete and 0 interrupted iterations
default   [  58% ] 80 VUs  00m03.0s/10m0s  057912/100000 shared iters

running (00m04.0s), 80/80 VUs, 79464 complete and 0 interrupted iterations
default   [  79% ] 80 VUs  00m04.0s/10m0s  079464/100000 shared iters
time="2025-06-05T13:57:59Z" level=info msg="INFO: Insert test finished." source=console
time="2025-06-05T13:57:59Z" level=info msg="INFO: Teardown cleanup finished." source=console

running (00m05.0s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m05.0s/10m0s  100000/100000 shared iters


  █ THRESHOLDS 

    checks{endpoint:postgres_insert}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_insert}
    ✓ 'p(95)<300' p(95)=6.2ms

    http_req_failed{endpoint:postgres_insert}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 100000  20045.08494/s
    checks_succeeded...................: 100.00% 100000 out of 100000
    checks_failed......................: 0.00%   0 out of 100000

    ✓ Postgres: insert status is 200

    HTTP
    http_req_duration...........................................................: avg=3.82ms min=192.25µs med=3.35ms max=285.91ms p(90)=5.28ms p(95)=6.2ms 
      { endpoint:postgres_insert }..............................................: avg=3.82ms min=192.25µs med=3.35ms max=285.91ms p(90)=5.28ms p(95)=6.2ms 
      { expected_response:true }................................................: avg=3.82ms min=192.25µs med=3.35ms max=285.91ms p(90)=5.28ms p(95)=6.2ms 
    http_req_failed.............................................................: 0.00%  0 out of 100001
      { endpoint:postgres_insert }..............................................: 0.00%  0 out of 100000
    http_reqs...................................................................: 100001 20045.285391/s

    EXECUTION
    iteration_duration..........................................................: avg=3.95ms min=233.07µs med=3.43ms max=292.04ms p(90)=5.53ms p(95)=6.62ms
    iterations..................................................................: 100000 20045.08494/s
    vus.........................................................................: 80     min=80          max=80
    vus_max.....................................................................: 80     min=80          max=80

    NETWORK
    data_received...............................................................: 9.2 MB 1.8 MB/s
    data_sent...................................................................: 26 MB  5.2 MB/s



running (00m05.0s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m05.0s/10m0s  100000/100000 shared iters
[SUCCESS] K6 AOT Insert test completed

=====================================================================
K6 AOT QUERY TEST
=====================================================================

[2025-06-05 13:57:59] Running K6 AOT Query test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/aot/query-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2025-06-05T13:57:59Z" level=info msg="INFO: Setting up 100 keys for query test..." source=console
time="2025-06-05T13:57:59Z" level=info msg="INFO: Setup progress... 10/100 keys inserted." source=console
time="2025-06-05T13:57:59Z" level=info msg="INFO: Setup progress... 20/100 keys inserted." source=console
time="2025-06-05T13:57:59Z" level=info msg="INFO: Setup progress... 30/100 keys inserted." source=console
time="2025-06-05T13:57:59Z" level=info msg="INFO: Setup progress... 40/100 keys inserted." source=console
time="2025-06-05T13:57:59Z" level=info msg="INFO: Setup progress... 50/100 keys inserted." source=console
time="2025-06-05T13:57:59Z" level=info msg="INFO: Setup progress... 60/100 keys inserted." source=console
time="2025-06-05T13:57:59Z" level=info msg="INFO: Setup progress... 70/100 keys inserted." source=console
time="2025-06-05T13:57:59Z" level=info msg="INFO: Setup progress... 80/100 keys inserted." source=console
time="2025-06-05T13:57:59Z" level=info msg="INFO: Setup progress... 90/100 keys inserted." source=console
time="2025-06-05T13:57:59Z" level=info msg="INFO: Setup progress... 100/100 keys inserted." source=console
time="2025-06-05T13:57:59Z" level=info msg="INFO: Setup complete. 100 keys available for querying." source=console

running (00m01.0s), 80/80 VUs, 21051 complete and 0 interrupted iterations
default   [  21% ] 80 VUs  00m01.0s/10m0s  021051/100000 shared iters

running (00m02.0s), 80/80 VUs, 44015 complete and 0 interrupted iterations
default   [  44% ] 80 VUs  00m02.0s/10m0s  044015/100000 shared iters

running (00m03.0s), 80/80 VUs, 67085 complete and 0 interrupted iterations
default   [  67% ] 80 VUs  00m03.0s/10m0s  067085/100000 shared iters

running (00m04.0s), 80/80 VUs, 90327 complete and 0 interrupted iterations
default   [  90% ] 80 VUs  00m04.0s/10m0s  090327/100000 shared iters
time="2025-06-05T13:58:03Z" level=info msg="INFO: Query test finished. Tested with 100 keys." source=console
time="2025-06-05T13:58:03Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_get}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_get}
    ✓ 'p(95)<300' p(95)=5.9ms

    http_req_failed{endpoint:postgres_get}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 300000  68006.703871/s
    checks_succeeded...................: 100.00% 300000 out of 300000
    checks_failed......................: 0.00%   0 out of 300000

    ✓ Postgres: get status is 200
    ✓ Postgres: get response has valid status
    ✓ Postgres: get response is valid JSON

    HTTP
    http_req_duration.......................................................: avg=3.36ms min=189.73µs med=3.11ms max=17.83ms p(90)=5.04ms p(95)=5.9ms 
      { endpoint:postgres_get }.............................................: avg=3.36ms min=189.73µs med=3.12ms max=17.83ms p(90)=5.04ms p(95)=5.9ms 
      { expected_response:true }............................................: avg=3.36ms min=189.73µs med=3.11ms max=17.83ms p(90)=5.04ms p(95)=5.9ms 
    http_req_failed.........................................................: 0.00%  0 out of 100101
      { endpoint:postgres_get }.............................................: 0.00%  0 out of 100000
    http_reqs...............................................................: 100101 22691.796881/s

    EXECUTION
    iteration_duration......................................................: avg=3.48ms min=237.21µs med=3.19ms max=17.88ms p(90)=5.26ms p(95)=6.18ms
    iterations..............................................................: 100000 22668.90129/s
    vus.....................................................................: 80     min=80          max=80
    vus_max.................................................................: 80     min=80          max=80

    NETWORK
    data_received...........................................................: 21 MB  4.8 MB/s
    data_sent...............................................................: 13 MB  2.9 MB/s



running (00m04.4s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m04.4s/10m0s  100000/100000 shared iters
[SUCCESS] K6 AOT Query test completed

=====================================================================
K6 NAOT INSERT TEST
=====================================================================

[2025-06-05 13:58:03] Running K6 NAOT Insert test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/naot/insert-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 80/80 VUs, 10262 complete and 0 interrupted iterations
default   [  10% ] 80 VUs  00m01.0s/10m0s  010262/100000 shared iters

running (00m02.0s), 80/80 VUs, 25872 complete and 0 interrupted iterations
default   [  26% ] 80 VUs  00m02.0s/10m0s  025872/100000 shared iters

running (00m03.0s), 80/80 VUs, 41221 complete and 0 interrupted iterations
default   [  41% ] 80 VUs  00m03.0s/10m0s  041221/100000 shared iters

running (00m04.0s), 80/80 VUs, 58808 complete and 0 interrupted iterations
default   [  59% ] 80 VUs  00m04.0s/10m0s  058808/100000 shared iters

running (00m05.0s), 80/80 VUs, 79378 complete and 0 interrupted iterations
default   [  79% ] 80 VUs  00m05.0s/10m0s  079378/100000 shared iters
time="2025-06-05T13:58:09Z" level=info msg="INFO: Insert test finished." source=console
time="2025-06-05T13:58:09Z" level=info msg="INFO: Teardown cleanup finished." source=console

running (00m06.0s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m06.0s/10m0s  100000/100000 shared iters


  █ THRESHOLDS 

    checks{endpoint:postgres_insert}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_insert}
    ✓ 'p(95)<300' p(95)=7.69ms

    http_req_failed{endpoint:postgres_insert}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 100000  16704.152321/s
    checks_succeeded...................: 100.00% 100000 out of 100000
    checks_failed......................: 0.00%   0 out of 100000

    ✓ Postgres: insert status is 200

    HTTP
    http_req_duration...........................................................: avg=4.62ms min=212.7µs  med=4.06ms max=322.18ms p(90)=6.49ms p(95)=7.69ms
      { endpoint:postgres_insert }..............................................: avg=4.62ms min=212.7µs  med=4.06ms max=322.18ms p(90)=6.49ms p(95)=7.69ms
      { expected_response:true }................................................: avg=4.62ms min=212.7µs  med=4.06ms max=322.18ms p(90)=6.49ms p(95)=7.69ms
    http_req_failed.............................................................: 0.00%  0 out of 100001
      { endpoint:postgres_insert }..............................................: 0.00%  0 out of 100000
    http_reqs...................................................................: 100001 16704.319363/s

    EXECUTION
    iteration_duration..........................................................: avg=4.75ms min=263.46µs med=4.15ms max=322.47ms p(90)=6.76ms p(95)=8.02ms
    iterations..................................................................: 100000 16704.152321/s
    vus.........................................................................: 80     min=80          max=80
    vus_max.....................................................................: 80     min=80          max=80

    NETWORK
    data_received...............................................................: 9.2 MB 1.5 MB/s
    data_sent...................................................................: 26 MB  4.3 MB/s



running (00m06.0s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m06.0s/10m0s  100000/100000 shared iters
[SUCCESS] K6 NAOT Insert test completed

=====================================================================
K6 NAOT QUERY TEST
=====================================================================

[2025-06-05 13:58:09] Running K6 NAOT Query test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/naot/query-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2025-06-05T13:58:09Z" level=info msg="INFO: Setting up 100 keys for query test..." source=console
time="2025-06-05T13:58:09Z" level=info msg="INFO: Setup progress... 10/100 keys inserted." source=console
time="2025-06-05T13:58:09Z" level=info msg="INFO: Setup progress... 20/100 keys inserted." source=console
time="2025-06-05T13:58:09Z" level=info msg="INFO: Setup progress... 30/100 keys inserted." source=console
time="2025-06-05T13:58:09Z" level=info msg="INFO: Setup progress... 40/100 keys inserted." source=console
time="2025-06-05T13:58:09Z" level=info msg="INFO: Setup progress... 50/100 keys inserted." source=console
time="2025-06-05T13:58:09Z" level=info msg="INFO: Setup progress... 60/100 keys inserted." source=console
time="2025-06-05T13:58:09Z" level=info msg="INFO: Setup progress... 70/100 keys inserted." source=console
time="2025-06-05T13:58:09Z" level=info msg="INFO: Setup progress... 80/100 keys inserted." source=console
time="2025-06-05T13:58:09Z" level=info msg="INFO: Setup progress... 90/100 keys inserted." source=console
time="2025-06-05T13:58:09Z" level=info msg="INFO: Setup progress... 100/100 keys inserted." source=console
time="2025-06-05T13:58:09Z" level=info msg="INFO: Setup complete. 100 keys available for querying." source=console

running (00m01.0s), 80/80 VUs, 18859 complete and 0 interrupted iterations
default   [  19% ] 80 VUs  00m01.0s/10m0s  018859/100000 shared iters

running (00m02.0s), 80/80 VUs, 41119 complete and 0 interrupted iterations
default   [  41% ] 80 VUs  00m02.0s/10m0s  041119/100000 shared iters

running (00m03.0s), 80/80 VUs, 63382 complete and 0 interrupted iterations
default   [  63% ] 80 VUs  00m03.0s/10m0s  063382/100000 shared iters

running (00m04.0s), 80/80 VUs, 86171 complete and 0 interrupted iterations
default   [  86% ] 80 VUs  00m04.0s/10m0s  086171/100000 shared iters
time="2025-06-05T13:58:14Z" level=info msg="INFO: Query test finished. Tested with 100 keys." source=console
time="2025-06-05T13:58:14Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_get}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_get}
    ✓ 'p(95)<300' p(95)=6.12ms

    http_req_failed{endpoint:postgres_get}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 300000  65151.786401/s
    checks_succeeded...................: 100.00% 300000 out of 300000
    checks_failed......................: 0.00%   0 out of 300000

    ✓ Postgres: get status is 200
    ✓ Postgres: get response has valid status
    ✓ Postgres: get response is valid JSON

    HTTP
    http_req_duration.......................................................: avg=3.5ms  min=181.31µs med=3.23ms max=26.02ms p(90)=5.24ms p(95)=6.12ms
      { endpoint:postgres_get }.............................................: avg=3.5ms  min=181.31µs med=3.24ms max=26.02ms p(90)=5.25ms p(95)=6.12ms
      { expected_response:true }............................................: avg=3.5ms  min=181.31µs med=3.23ms max=26.02ms p(90)=5.24ms p(95)=6.12ms
    http_req_failed.........................................................: 0.00%  0 out of 100101
      { endpoint:postgres_get }.............................................: 0.00%  0 out of 100000
    http_reqs...............................................................: 100101 21739.196569/s

    EXECUTION
    iteration_duration......................................................: avg=3.63ms min=229.16µs med=3.32ms max=26.67ms p(90)=5.49ms p(95)=6.46ms
    iterations..............................................................: 100000 21717.262134/s
    vus.....................................................................: 80     min=80          max=80
    vus_max.................................................................: 80     min=80          max=80

    NETWORK
    data_received...........................................................: 21 MB  4.6 MB/s
    data_sent...............................................................: 13 MB  2.8 MB/s



running (00m04.6s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m04.6s/10m0s  100000/100000 shared iters
[SUCCESS] K6 NAOT Query test completed
[SUCCESS] All available K6 benchmarks completed
[2025-06-05 13:58:14] Cleaning up PostgreSQL test data...

=====================================================================
POSTGRESQL CLEANUP
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
[SUCCESS] PostgreSQL cleanup completed

=====================================================================
BENCHMARK COMPLETION
=====================================================================
End Time: Thu Jun  5 13:58:14 UTC 2025
Duration: 12 minutes and 15 seconds
Results saved to: sysbench_results_c8g.2xlarge_20250605_134559.txt
=====================================================================
[2025-06-05 13:58:14] ================================================
[SUCCESS] All benchmarks completed successfully!
[2025-06-05 13:58:14] Detailed results saved to: sysbench_results_c8g.2xlarge_20250605_134559.txt